XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3HighPerformance_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>FM3HighPerformance_DFP</name>
  <description>Cypress FM3 High Performance Series Device Support and Examples</description>

  <releases>
    <release version="1.2.1" date="2023-09-04" deprecated="2023-09-04">
      This Software Pack is no longer maintained. Please contact the device vendor (Cypress) for support.
	</release>
    <release version="1.2.0" date="2019-05-28">
      Updated Device Vendor: changed from Spansion to Cypress.
      Removed Board Support for Spansion SK-FM3-176PMC-ETHERNET evaluation board
    </release>
    <release version="1.1.0" date="2014-09-16">
      Added Board Support for ARM Keil MCB9B500 development board
      Added Board Support for Spansion SK-FM3-176PMC-ETHERNET evaluation board
    </release>
    <release version="1.0.1">
      Updated device descriptions with features
    </release>
    <release version="1.0.0">
      First Release version of FM3 High Performance Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Cypress</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Cypress</keyword>
    <keyword>FM3 High Performance</keyword>
    <keyword>MB9A</keyword>
    <keyword>MB9B</keyword>
    <keyword>MCB9B500</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="FM3 High Performance Series" Dvendor="Cypress:19">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1"/>
      <book    name="Documents/dui0552a_cortex_m3_dgug.pdf"           title="Cortex-M3 Generic User Guide"/>
        <description>
The FM3 Series is designed for cost-sensitive embedded control applications.
Typical applications include Industrial, Motor control, Factory automation, White goods, Power tools, Medical and health care, Hand-held devices

  - highly reliable Flash (100,000 erase/write cycles) with 0 wait states at 72MHz)
  - long term availability (> 10 years)
        </description>

      <!-- ************************  Subfamily 'MB9BF100'  **************************** -->
      <subFamily DsubFamily="MB9BF100">
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
      
      <!-- *************************  Device 'MB9BF102N'  ***************************** -->
      <device Dname="MB9BF102N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B100A/mb9b100n.h"  define="MB9BF102N"/>
        <debug      svd="SVD/MB9BF10xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx02_128.FLM"   start="0x00000000"  size="0x20000"                  default="1"/>
        <book       name="Documents/MB9BF102NA-DS706-00020-1v0-E.pdf"                    title="MB9B100A Series Data Sheet"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF102R'  ***************************** -->
      <device Dname="MB9BF102R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B100A/mb9b100r.h"  define="MB9BF102R"/>
        <debug      svd="SVD/MB9BF10xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx02_128.FLM"   start="0x00000000"  size="0x20000"                  default="1"/>
        <book       name="Documents/MB9BF102NA-DS706-00020-1v0-E.pdf"                    title="MB9B100A Series Data Sheet"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF104N'  ***************************** -->
      <device Dname="MB9BF104N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B100A/mb9b100n.h"  define="MB9BF104N"/>
        <debug      svd="SVD/MB9BF10xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/MB9BF102NA-DS706-00020-1v0-E.pdf"                    title="MB9B100A Series Data Sheet"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF104R'  ***************************** -->
      <device Dname="MB9BF104R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B100A/mb9b100r.h"  define="MB9BF104R"/>
        <debug      svd="SVD/MB9BF10xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/MB9BF102NA-DS706-00020-1v0-E.pdf"                    title="MB9B100A Series Data Sheet"/>
        <feature type="IOs"           n="120"/>
      </device>
      
