XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3HighPerformance_DFP.pdsc
      <!-- *************************  Device 'MB9BF217T'  ***************************** -->
      <device Dname="MB9BF217T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B210T/mb9b210t.h"  define="MB9BF217T"/>
        <debug      svd="SVD/MB9BF21xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF4000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx07_768.FLM"   start="0x00000000"  size="0xC0000"                  default="1"/>
        <book       name="Documents/MB9BF216S-DS706-00015-2v0-E.pdf"                    title="MB9B210T Series Data Sheet"/>
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="IOs"           n="176"/>
      </device>
      
      <!-- *************************  Device 'MB9BF218S'  ***************************** -->
      <device Dname="MB9BF218S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B210T/mb9b210s.h"  define="MB9BF218S"/>
        <debug      svd="SVD/MB9BF21xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx08_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <book       name="Documents/MB9BF216S-DS706-00015-2v0-E.pdf"                    title="MB9B210T Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="144"/>
      </device>
      
      <!-- *************************  Device 'MB9BF218T'  ***************************** -->
      <device Dname="MB9BF218T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B210T/mb9b210t.h"  define="MB9BF218T"/>
        <debug      svd="SVD/MB9BF21xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx08_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <book       name="Documents/MB9BF216S-DS706-00015-2v0-E.pdf"                    title="MB9B210T Series Data Sheet"/>
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="IOs"           n="176"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9BF300'  **************************** -->
      <subFamily DsubFamily="MB9BF300">
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="USBD"          n="1"/>
      
      <!-- *************************  Device 'MB9BF304N'  ***************************** -->
      <device Dname="MB9BF304N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B300B/mb9b300n.h"  define="MB9BF304N"/>
        <debug      svd="SVD/MB9BF30xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/MB9BF304NB-DS706-00024-2v0-E.pdf"                    title="MB9B300B Series Data Sheet"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF304R'  ***************************** -->
      <device Dname="MB9BF304R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B300B/mb9b300r.h"  define="MB9BF304R"/>
        <debug      svd="SVD/MB9BF30xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/MB9BF304NB-DS706-00024-2v0-E.pdf"                    title="MB9B300B Series Data Sheet"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF305N'  ***************************** -->
      <device Dname="MB9BF305N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B300B/mb9b300n.h"  define="MB9BF305N"/>
        <debug      svd="SVD/MB9BF30xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx05_384.FLM"   start="0x00000000"  size="0x60000"                  default="1"/>
        <book       name="Documents/MB9BF304NB-DS706-00024-2v0-E.pdf"                    title="MB9B300B Series Data Sheet"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF305R'  ***************************** -->
      <device Dname="MB9BF305R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B300B/mb9b300r.h"  define="MB9BF305R"/>
        <debug      svd="SVD/MB9BF30xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx05_384.FLM"   start="0x00000000"  size="0x60000"                  default="1"/>
        <book       name="Documents/MB9BF304NB-DS706-00024-2v0-E.pdf"                    title="MB9B300B Series Data Sheet"/>
        <feature type="IOs"           n="120"/>
      </device>
      
