XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3HighPerformance_DFP.pdsc
      <!-- *************************  Device 'MB9BF306N'  ***************************** -->
      <device Dname="MB9BF306N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B300B/mb9b300n.h"  define="MB9BF306N"/>
        <debug      svd="SVD/MB9BF30xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9BF304NB-DS706-00024-2v0-E.pdf"                    title="MB9B300B Series Data Sheet"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF306R'  ***************************** -->
      <device Dname="MB9BF306R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B300B/mb9b300r.h"  define="MB9BF306R"/>
        <debug      svd="SVD/MB9BF30xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9BF304NB-DS706-00024-2v0-E.pdf"                    title="MB9B300B Series Data Sheet"/>
        <feature type="IOs"           n="120"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9BF310'  **************************** -->
      <subFamily DsubFamily="MB9BF310">
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
      
      <!-- *************************  Device 'MB9BF312N'  ***************************** -->
      <device Dname="MB9BF312N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B310R/mb9b310n.h"  define="MB9BF312N"/>
        <debug      svd="SVD/MB9BF31xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx02_128.FLM"   start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF316R-DS706-00027-2v0-E.pdf"                    title="MB9B310R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF312R'  ***************************** -->
      <device Dname="MB9BF312R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B310R/mb9b310r.h"  define="MB9BF312R"/>
        <debug      svd="SVD/MB9BF31xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx02_128.FLM"   start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF316R-DS706-00027-2v0-E.pdf"                    title="MB9B310R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF314N'  ***************************** -->
      <device Dname="MB9BF314N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B310R/mb9b310n.h"  define="MB9BF314N"/>
        <debug      svd="SVD/MB9BF31xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF316R-DS706-00027-2v0-E.pdf"                    title="MB9B310R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="100"/>
      </device>
      
