XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3HighPerformance_DFP.pdsc
      <!-- *************************  Device 'MB9BF314R'  ***************************** -->
      <device Dname="MB9BF314R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B310R/mb9b310r.h"  define="MB9BF314R"/>
        <debug      svd="SVD/MB9BF31xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF316R-DS706-00027-2v0-E.pdf"                    title="MB9B310R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF315N'  ***************************** -->
      <device Dname="MB9BF315N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B310R/mb9b310n.h"  define="MB9BF315N"/>
        <debug      svd="SVD/MB9BF31xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx05_384.FLM"   start="0x00000000"  size="0x60000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF316R-DS706-00027-2v0-E.pdf"                    title="MB9B310R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF315R'  ***************************** -->
      <device Dname="MB9BF315R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B310R/mb9b310r.h"  define="MB9BF315R"/>
        <debug      svd="SVD/MB9BF31xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx05_384.FLM"   start="0x00000000"  size="0x60000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF316R-DS706-00027-2v0-E.pdf"                    title="MB9B310R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF316N'  ***************************** -->
      <device Dname="MB9BF316N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B310R/mb9b310n.h"  define="MB9BF316N"/>
        <debug      svd="SVD/MB9BF31xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF316R-DS706-00027-2v0-E.pdf"                    title="MB9B310R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF316R'  ***************************** -->
      <device Dname="MB9BF316R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B310R/mb9b310r.h"  define="MB9BF316R"/>
        <debug      svd="SVD/MB9BF31xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF316R-DS706-00027-2v0-E.pdf"                    title="MB9B310R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF316S'  ***************************** -->
      <device Dname="MB9BF316S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B310T/mb9b310s.h"  define="MB9BF316S"/>
        <debug      svd="SVD/MB9BF31xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9BF316S-DS706-00017-2v0-E.pdf"                    title="MB9B310T Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="USBD"          n="2"/>
        <feature type="IOs"           n="144"/>
      </device>
      
      <!-- *************************  Device 'MB9BF316T'  ***************************** -->
      <device Dname="MB9BF316T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B310T/mb9b310t.h"  define="MB9BF316T"/>
        <debug      svd="SVD/MB9BF31xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9BF316S-DS706-00017-2v0-E.pdf"                    title="MB9B310T Series Data Sheet"/>
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="USBD"          n="2"/>
        <feature type="IOs"           n="176"/>
      </device>
      
