XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3HighPerformance_DFP.pdsc
      <!-- *************************  Device 'MB9BF317S'  ***************************** -->
      <device Dname="MB9BF317S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B310T/mb9b310s.h"  define="MB9BF317S"/>
        <debug      svd="SVD/MB9BF31xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF4000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx07_768.FLM"   start="0x00000000"  size="0xC0000"                  default="1"/>
        <book       name="Documents/MB9BF316S-DS706-00017-2v0-E.pdf"                    title="MB9B310T Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="USBD"          n="2"/>
        <feature type="IOs"           n="144"/>
      </device>
      
      <!-- *************************  Device 'MB9BF317T'  ***************************** -->
      <device Dname="MB9BF317T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B310T/mb9b310t.h"  define="MB9BF317T"/>
        <debug      svd="SVD/MB9BF31xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF4000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx07_768.FLM"   start="0x00000000"  size="0xC0000"                  default="1"/>
        <book       name="Documents/MB9BF316S-DS706-00017-2v0-E.pdf"                    title="MB9B310T Series Data Sheet"/>
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="USBD"          n="2"/>
        <feature type="IOs"           n="176"/>
      </device>
      
      <!-- *************************  Device 'MB9BF318S'  ***************************** -->
      <device Dname="MB9BF318S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B310T/mb9b310s.h"  define="MB9BF318S"/>
        <debug      svd="SVD/MB9BF31xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx08_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <book       name="Documents/MB9BF316S-DS706-00017-2v0-E.pdf"                    title="MB9B310T Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="USBD"          n="2"/>
        <feature type="IOs"           n="144"/>
      </device>
      
      <!-- *************************  Device 'MB9BF318T'  ***************************** -->
      <device Dname="MB9BF318T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B310T/mb9b310t.h"  define="MB9BF318T"/>
        <debug      svd="SVD/MB9BF31xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx08_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <book       name="Documents/MB9BF316S-DS706-00017-2v0-E.pdf"                    title="MB9B310T Series Data Sheet"/>
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="USBD"          n="2"/>
        <feature type="IOs"           n="176"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9BF400'  **************************** -->
      <subFamily DsubFamily="MB9BF400">
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="CAN"           n="2"/>
      
      <!-- *************************  Device 'MB9BF404N'  ***************************** -->
      <device Dname="MB9BF404N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B400A/mb9b400n.h"  define="MB9BF404N"/>
        <debug      svd="SVD/MB9BF40xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/MB9BF404NA-DS706-00023-1v0-E.pdf"                    title="MB9B400A Series Data Sheet"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF404R'  ***************************** -->
      <device Dname="MB9BF404R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B400A/mb9b400r.h"  define="MB9BF404R"/>
        <debug      svd="SVD/MB9BF40xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/MB9BF404NA-DS706-00023-1v0-E.pdf"                    title="MB9B400A Series Data Sheet"/>
        <feature type="IOs"           n="120"/>
      </device>
      
