XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3HighPerformance_DFP.pdsc
      <!-- *************************  Device 'MB9BF405N'  ***************************** -->
      <device Dname="MB9BF405N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B400A/mb9b400n.h"  define="MB9BF405N"/>
        <debug      svd="SVD/MB9BF40xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx05_384.FLM"   start="0x00000000"  size="0x60000"                  default="1"/>
        <book       name="Documents/MB9BF404NA-DS706-00023-1v0-E.pdf"                    title="MB9B400A Series Data Sheet"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF405R'  ***************************** -->
      <device Dname="MB9BF405R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B400A/mb9b400r.h"  define="MB9BF405R"/>
        <debug      svd="SVD/MB9BF40xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx05_384.FLM"   start="0x00000000"  size="0x60000"                  default="1"/>
        <book       name="Documents/MB9BF404NA-DS706-00023-1v0-E.pdf"                    title="MB9B400A Series Data Sheet"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF406N'  ***************************** -->
      <device Dname="MB9BF406N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B400A/mb9b400n.h"  define="MB9BF406N"/>
        <debug      svd="SVD/MB9BF40xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9BF404NA-DS706-00023-1v0-E.pdf"                    title="MB9B400A Series Data Sheet"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF406R'  ***************************** -->
      <device Dname="MB9BF406R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B400A/mb9b400r.h"  define="MB9BF406R"/>
        <debug      svd="SVD/MB9BF40xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9BF404NA-DS706-00023-1v0-E.pdf"                    title="MB9B400A Series Data Sheet"/>
        <feature type="IOs"           n="120"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9BF410'  **************************** -->
      <subFamily DsubFamily="MB9BF410">
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="CAN"           n="2"/>
      
      <!-- *************************  Device 'MB9BF412N'  ***************************** -->
      <device Dname="MB9BF412N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B410R/mb9b410n.h"  define="MB9BF412N"/>
        <debug      svd="SVD/MB9BF41xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx02_128.FLM"   start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF416R-DS706-00026-2v0-E.pdf"                    title="MB9B410R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF412R'  ***************************** -->
      <device Dname="MB9BF412R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B410R/mb9b410r.h"  define="MB9BF412R"/>
        <debug      svd="SVD/MB9BF41xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx02_128.FLM"   start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF416R-DS706-00026-2v0-E.pdf"                    title="MB9B410R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF414N'  ***************************** -->
      <device Dname="MB9BF414N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B410R/mb9b410n.h"  define="MB9BF414N"/>
        <debug      svd="SVD/MB9BF41xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF416R-DS706-00026-2v0-E.pdf"                    title="MB9B410R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF414R'  ***************************** -->
      <device Dname="MB9BF414R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B410R/mb9b410r.h"  define="MB9BF414R"/>
        <debug      svd="SVD/MB9BF41xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF416R-DS706-00026-2v0-E.pdf"                    title="MB9B410R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF415N'  ***************************** -->
      <device Dname="MB9BF415N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B410R/mb9b410n.h"  define="MB9BF415N"/>
        <debug      svd="SVD/MB9BF41xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx05_384.FLM"   start="0x00000000"  size="0x60000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF416R-DS706-00026-2v0-E.pdf"                    title="MB9B410R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF415R'  ***************************** -->
      <device Dname="MB9BF415R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B410R/mb9b410r.h"  define="MB9BF415R"/>
        <debug      svd="SVD/MB9BF41xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx05_384.FLM"   start="0x00000000"  size="0x60000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF416R-DS706-00026-2v0-E.pdf"                    title="MB9B410R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF416N'  ***************************** -->
      <device Dname="MB9BF416N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B410R/mb9b410n.h"  define="MB9BF416N"/>
        <debug      svd="SVD/MB9BF41xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF416R-DS706-00026-2v0-E.pdf"                    title="MB9B410R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF416R'  ***************************** -->
      <device Dname="MB9BF416R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B410R/mb9b410r.h"  define="MB9BF416R"/>
        <debug      svd="SVD/MB9BF41xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF416R-DS706-00026-2v0-E.pdf"                    title="MB9B410R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF416S'  ***************************** -->
      <device Dname="MB9BF416S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B410T/mb9b410s.h"  define="MB9BF416S"/>
        <debug      svd="SVD/MB9BF41xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9BF416S-DS706-00018-1v0-E.pdf"                    title="MB9B410T Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="144"/>
      </device>
      
      <!-- *************************  Device 'MB9BF416T'  ***************************** -->
      <device Dname="MB9BF416T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B410T/mb9b410t.h"  define="MB9BF416T"/>
        <debug      svd="SVD/MB9BF41xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9BF416S-DS706-00018-1v0-E.pdf"                    title="MB9B410T Series Data Sheet"/>
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="IOs"           n="176"/>
      </device>
      
      <!-- *************************  Device 'MB9BF417S'  ***************************** -->
      <device Dname="MB9BF417S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B410T/mb9b410s.h"  define="MB9BF417S"/>
        <debug      svd="SVD/MB9BF41xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF4000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx07_768.FLM"   start="0x00000000"  size="0xC0000"                  default="1"/>
        <book       name="Documents/MB9BF416S-DS706-00018-1v0-E.pdf"                    title="MB9B410T Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="144"/>
      </device>
      
