XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3HighPerformance_DFP.pdsc
      <!-- *************************  Device 'MB9BF417T'  ***************************** -->
      <device Dname="MB9BF417T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B410T/mb9b410t.h"  define="MB9BF417T"/>
        <debug      svd="SVD/MB9BF41xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF4000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx07_768.FLM"   start="0x00000000"  size="0xC0000"                  default="1"/>
        <book       name="Documents/MB9BF416S-DS706-00018-1v0-E.pdf"                    title="MB9B410T Series Data Sheet"/>
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="IOs"           n="176"/>
      </device>
      
      <!-- *************************  Device 'MB9BF418S'  ***************************** -->
      <device Dname="MB9BF418S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B410T/mb9b410s.h"  define="MB9BF418S"/>
        <debug      svd="SVD/MB9BF41xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx08_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <book       name="Documents/MB9BF416S-DS706-00018-1v0-E.pdf"                    title="MB9B410T Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="144"/>
      </device>
      
      <!-- *************************  Device 'MB9BF418T'  ***************************** -->
      <device Dname="MB9BF418T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B410T/mb9b410t.h"  define="MB9BF418T"/>
        <debug      svd="SVD/MB9BF41xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx08_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <book       name="Documents/MB9BF416S-DS706-00018-1v0-E.pdf"                    title="MB9B410T Series Data Sheet"/>
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="IOs"           n="176"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9BF500'  **************************** -->
      <subFamily DsubFamily="MB9BF500">
      
      <!-- *************************  Device 'MB9BF500N'  ***************************** -->
      <device Dname="MB9BF500N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9BF50x/MB9BF50x.h"  define="MB9BF500N"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BF500_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/mb9bf500n_500r_ds.pdf"                    title="MB9BF50x Series Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'MB9BF500R'  ***************************** -->
      <device Dname="MB9BF500R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9BF50x/MB9BF50x.h"  define="MB9BF500R"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BF500_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/mb9bf500n_500r_ds.pdf"                    title="MB9BF50x Series Data Sheet"/>
      </device>
      
      <!-- *************************  Device 'MB9BF504N'  ***************************** -->
      <device Dname="MB9BF504N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B500B/mb9b500n.h"  define="MB9BF504N"/>
        <debug      svd="SVD/MB9BF50xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/MB9BF504NB-DS706-00021-2v0-E.pdf"                    title="MB9B500B Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="CAN"           n="2"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF504R'  ***************************** -->
      <device Dname="MB9BF504R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B500B/mb9b500r.h"  define="MB9BF504R"/>
        <debug      svd="SVD/MB9BF50xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <book       name="Documents/MB9BF504NB-DS706-00021-2v0-E.pdf"                    title="MB9B500B Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="CAN"           n="2"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF505N'  ***************************** -->
      <device Dname="MB9BF505N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B500B/mb9b500n.h"  define="MB9BF505N"/>
        <debug      svd="SVD/MB9BF50xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx05_384.FLM"   start="0x00000000"  size="0x60000"                  default="1"/>
        <book       name="Documents/MB9BF504NB-DS706-00021-2v0-E.pdf"                    title="MB9B500B Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="CAN"           n="2"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF505R'  ***************************** -->
      <device Dname="MB9BF505R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B500B/mb9b500r.h"  define="MB9BF505R"/>
        <debug      svd="SVD/MB9BF50xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx05_384.FLM"   start="0x00000000"  size="0x60000"                  default="1"/>
        <book       name="Documents/MB9BF504NB-DS706-00021-2v0-E.pdf"                    title="MB9B500B Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="CAN"           n="2"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="120"/>
      </device>
      
