XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3HighPerformance_DFP.pdsc
      <!-- *************************  Device 'MB9BF506N'  ***************************** -->
      <device Dname="MB9BF506N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B500B/mb9b500n.h"  define="MB9BF506N"/>
        <debug      svd="SVD/MB9BF50xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9BF504NB-DS706-00021-2v0-E.pdf"                    title="MB9B500B Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="CAN"           n="2"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF506R'  ***************************** -->
      <device Dname="MB9BF506R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="80000000"/>
        <compile header="Device/Include/MB9B500B/mb9b500r.h"  define="MB9BF506R"/>
        <debug      svd="SVD/MB9BF50xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9BF504NB-DS706-00021-2v0-E.pdf"                    title="MB9B500B Series Data Sheet"/>
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="CAN"           n="2"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="120"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9BF510'  **************************** -->
      <subFamily DsubFamily="MB9BF510">
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="CAN"           n="2"/>
      
      <!-- *************************  Device 'MB9BF512N'  ***************************** -->
      <device Dname="MB9BF512N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B510R/mb9b510n.h"  define="MB9BF512N"/>
        <debug      svd="SVD/MB9BF51xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx02_128.FLM"   start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF516R-DS706-00025-2v0-E.pdf"                    title="MB9B510R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF512R'  ***************************** -->
      <device Dname="MB9BF512R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B510R/mb9b510r.h"  define="MB9BF512R"/>
        <debug      svd="SVD/MB9BF51xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFE000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx02_128.FLM"   start="0x00000000"  size="0x20000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF516R-DS706-00025-2v0-E.pdf"                    title="MB9B510R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF514N'  ***************************** -->
      <device Dname="MB9BF514N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B510R/mb9b510n.h"  define="MB9BF514N"/>
        <debug      svd="SVD/MB9BF51xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF516R-DS706-00025-2v0-E.pdf"                    title="MB9B510R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="100"/>
      </device>
      
