XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3HighPerformance_DFP.pdsc
      <!-- *************************  Device 'MB9BF514R'  ***************************** -->
      <device Dname="MB9BF514R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B510R/mb9b510r.h"  define="MB9BF514R"/>
        <debug      svd="SVD/MB9BF51xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x40000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFC000"  size="0x4000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx04_256.FLM"   start="0x00000000"  size="0x40000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF516R-DS706-00025-2v0-E.pdf"                    title="MB9B510R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF515N'  ***************************** -->
      <device Dname="MB9BF515N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B510R/mb9b510n.h"  define="MB9BF515N"/>
        <debug      svd="SVD/MB9BF51xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx05_384.FLM"   start="0x00000000"  size="0x60000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF516R-DS706-00025-2v0-E.pdf"                    title="MB9B510R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF515R'  ***************************** -->
      <device Dname="MB9BF515R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B510R/mb9b510r.h"  define="MB9BF515R"/>
        <debug      svd="SVD/MB9BF51xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x60000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x6000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFFA000"  size="0x6000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx05_384.FLM"   start="0x00000000"  size="0x60000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF516R-DS706-00025-2v0-E.pdf"                    title="MB9B510R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF516N'  ***************************** -->
      <device Dname="MB9BF516N">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B510R/mb9b510n.h"  define="MB9BF516N"/>
        <debug      svd="SVD/MB9BF51xN.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF516R-DS706-00025-2v0-E.pdf"                    title="MB9B510R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="100"/>
      </device>
      
      <!-- *************************  Device 'MB9BF516R'  ***************************** -->
      <device Dname="MB9BF516R">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B510R/mb9b510r.h"  define="MB9BF516R"/>
        <debug      svd="SVD/MB9BF51xR.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IROM2"                      start="0x200C0000"  size="0x8000"     startup="0"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <algorithm  name="Flash/MB9xFxxx_32WF.FLM"  start="0x200C0000"  size="0x8000"                   default="1"/>
        <book       name="Documents/MB9BF516R-DS706-00025-2v0-E.pdf"                    title="MB9B510R Series Data Sheet"/>
        <feature type="ADC"           n="16"      m="12"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="120"/>
      </device>
      
      <!-- *************************  Device 'MB9BF516S'  ***************************** -->
      <device Dname="MB9BF516S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B510T/mb9b510s.h"  define="MB9BF516S"/>
        <debug      svd="SVD/MB9BF51xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9BF516S-DS706-00019-1v0-E.pdf"                    title="MB9B510T Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="USBD"          n="2"/>
        <feature type="IOs"           n="144"/>
      </device>
      
      <!-- *************************  Device 'MB9BF516T'  ***************************** -->
      <device Dname="MB9BF516T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B510T/mb9b510t.h"  define="MB9BF516T"/>
        <debug      svd="SVD/MB9BF51xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9BF516S-DS706-00019-1v0-E.pdf"                    title="MB9B510T Series Data Sheet"/>
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="USBD"          n="2"/>
        <feature type="IOs"           n="176"/>
      </device>
      
