XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3HighPerformance_DFP.pdsc
      <!-- *************************  Device 'MB9BF517S'  ***************************** -->
      <device Dname="MB9BF517S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B510T/mb9b510s.h"  define="MB9BF517S"/>
        <debug      svd="SVD/MB9BF51xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF4000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx07_768.FLM"   start="0x00000000"  size="0xC0000"                  default="1"/>
        <book       name="Documents/MB9BF516S-DS706-00019-1v0-E.pdf"                    title="MB9B510T Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="USBD"          n="2"/>
        <feature type="IOs"           n="144"/>
      </device>
      
      <!-- *************************  Device 'MB9BF517T'  ***************************** -->
      <device Dname="MB9BF517T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B510T/mb9b510t.h"  define="MB9BF517T"/>
        <debug      svd="SVD/MB9BF51xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xC0000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0xC000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF4000"  size="0xC000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx07_768.FLM"   start="0x00000000"  size="0xC0000"                  default="1"/>
        <book       name="Documents/MB9BF516S-DS706-00019-1v0-E.pdf"                    title="MB9B510T Series Data Sheet"/>
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="USBD"          n="2"/>
        <feature type="IOs"           n="176"/>
      </device>
      
      <!-- *************************  Device 'MB9BF518S'  ***************************** -->
      <device Dname="MB9BF518S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B510T/mb9b510s.h"  define="MB9BF518S"/>
        <debug      svd="SVD/MB9BF51xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx08_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <book       name="Documents/MB9BF516S-DS706-00019-1v0-E.pdf"                    title="MB9B510T Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="USBD"          n="2"/>
        <feature type="IOs"           n="144"/>
      </device>
      
      <!-- *************************  Device 'MB9BF518T'  ***************************** -->
      <device Dname="MB9BF518T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B510T/mb9b510t.h"  define="MB9BF518T"/>
        <debug      svd="SVD/MB9BF51xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx08_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <book       name="Documents/MB9BF516S-DS706-00019-1v0-E.pdf"                    title="MB9B510T Series Data Sheet"/>
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="USBD"          n="2"/>
        <feature type="IOs"           n="176"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'MB9BF610'  **************************** -->
      <subFamily DsubFamily="MB9BF610">
        <feature type="DMA"           n="8"/>
        <feature type="ExtBus"        n="1"/>
        <feature type="MPSerial"      n="8"                           name="UART / SIO / I2C"/>
        <feature type="USBD"          n="2"/>
      
      <!-- *************************  Device 'MB9BF616S'  ***************************** -->
      <device Dname="MB9BF616S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B610T/mb9b610s.h"  define="MB9BF616S"/>
        <debug      svd="SVD/MB9BF61xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9BF616S-DS706-00014-2v0-E.pdf"                    title="MB9B610T Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="144"/>
      </device>
      
      <!-- *************************  Device 'MB9BF616T'  ***************************** -->
      <device Dname="MB9BF616T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9B610T/mb9b610t.h"  define="MB9BF616T"/>
        <debug      svd="SVD/MB9BF61xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x80000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF8000"  size="0x8000"     init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx06_512.FLM"   start="0x00000000"  size="0x80000"                  default="1"/>
        <book       name="Documents/MB9BF616S-DS706-00014-2v0-E.pdf"                    title="MB9B610T Series Data Sheet"/>
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="IOs"           n="176"/>
      </device>
      
