XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3HighPerformance_DFP.pdsc
      <!-- *************************  Device 'MB9BFD18S'  ***************************** -->
      <device Dname="MB9BFD18S">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9BD10T/mb9bd10s.h"  define="MB9BFD18S"/>
        <debug      svd="SVD/MB9BFD1xS.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx08_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <book       name="Documents/MB9BFD16T-DS706-00031-1v0-E.pdf"                    title="MB9BD10T Series Data Sheet"/>
        <feature type="ADC"           n="24"      m="12"/>
        <feature type="IOs"           n="144"/>
      </device>
      
      <!-- *************************  Device 'MB9BFD18T'  ***************************** -->
      <device Dname="MB9BFD18T">
        <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="144000000"/>
        <compile header="Device/Include/MB9BD10T/mb9bd10t.h"  define="MB9BFD18T"/>
        <debug      svd="SVD/MB9BFD1xT.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x100000"   startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x1FFF0000"  size="0x10000"    init   ="0"   default="1"/>
        <algorithm  name="Flash/MB9BFx08_1024.FLM"  start="0x00000000"  size="0x100000"                 default="1"/>
        <book       name="Documents/MB9BFD16T-DS706-00031-1v0-E.pdf"                    title="MB9BD10T Series Data Sheet"/>
        <feature type="ADC"           n="32"      m="12"/>
        <feature type="IOs"           n="176"/>
      </device>
      </subFamily>

    </family>
  </devices>

  <boards>
    <board vendor="Keil" name="MCB9B500" revision="v2.1" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCB9B500=ON">
      <description>Keil MCB9B500 Development Board</description>
      <image small="Images/mcb9bf500_board_small.jpg" large="Images/mcb9bf500_board_big.jpg"/>
      <book category="overview"  name="http://www.keil.com/MCB9B500/" title="MCB9B500 Web Page"/>
      <book category="schematic" name="Documents/mcb9bf500-schematics.pdf" title="Schematics"/>
      <book category="manual"    name="Documents/mcb9b500.chm" title="User Manual" />
      <mountedDevice    deviceIndex="0" Dvendor="Cypress:19" Dname="MB9BF506R"/>
      <compatibleDevice deviceIndex="0" Dvendor="Cypress:19" DsubFamily="MB9BF500"/>
      <feature type="XTAL"      n="4000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="Button"    n="5"              name="Push-buttons: 4x GPIO, Reset"/>
      <feature type="LED"       n="9"              name="LEDs: Power, 8x User: green"/>
      <feature type="USB"       n="1"              name="USB Device Interface"/>
      <feature type="USB"       n="1"              name="USB Host/OTG"/>
      <feature type="DIO"       n="120"/>
      <feature type="Poti"      n="1"/>
      <debugInterface adapter="JTAG/SW" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex Debug + ETM Connector (0.05 inch connector)"/>
      <feature type="CustomFF"  n="120" m="60"/>
    </board>
  </boards>  

  <conditions>
    <!-- conditions are dependency rules that can apply to a component or an individual file -->
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="MB9B100A">
      <description>Cypress FM3 MB9B100A Device</description>
      <require Dvendor="Cypress:19"/>
	  <require condition="Compiler ARM"/>
      <accept  Dname="MB9BF102N"/>
      <accept  Dname="MB9BF102R"/>
      <accept  Dname="MB9BF104N"/>
      <accept  Dname="MB9BF104R"/>
      <accept  Dname="MB9BF105N"/>
      <accept  Dname="MB9BF105R"/>
      <accept  Dname="MB9BF106N"/>
      <accept  Dname="MB9BF106R"/>
    </condition>

    <condition id="MB9B110R">
      <description>Cypress FM3 MB9B110R Device</description>
      <require Dvendor="Cypress:19"/>
	  <require condition="Compiler ARM"/>
      <accept  Dname="MB9BF112N"/>
      <accept  Dname="MB9BF112R"/>
      <accept  Dname="MB9BF114N"/>
      <accept  Dname="MB9BF114R"/>
      <accept  Dname="MB9BF115N"/>
      <accept  Dname="MB9BF115R"/>
      <accept  Dname="MB9BF116N"/>
      <accept  Dname="MB9BF116R"/>
      <accept  Dname="MB9BF116S"/>
      <accept  Dname="MB9BF116T"/>
      <accept  Dname="MB9BF117S"/>
      <accept  Dname="MB9BF117T"/>
      <accept  Dname="MB9BF118S"/>
      <accept  Dname="MB9BF118T"/>
    </condition>

    <condition id="MB9B210T">
      <description>Cypress FM3 MB9B210T Device</description>
      <require Dvendor="Cypress:19"/>
	  <require condition="Compiler ARM"/>
      <accept  Dname="MB9BF216S"/>
      <accept  Dname="MB9BF216T"/>
      <accept  Dname="MB9BF217S"/>
      <accept  Dname="MB9BF217T"/>
      <accept  Dname="MB9BF218S"/>
      <accept  Dname="MB9BF218T"/>
    </condition>

    <condition id="MB9B300B">
      <description>Cypress FM3 MB9B300B Device</description>
      <require Dvendor="Cypress:19"/>
	  <require condition="Compiler ARM"/>
      <accept  Dname="MB9BF304N"/>
      <accept  Dname="MB9BF304R"/>
      <accept  Dname="MB9BF305N"/>
      <accept  Dname="MB9BF305R"/>
      <accept  Dname="MB9BF306N"/>
      <accept  Dname="MB9BF306R"/>
    </condition>

    <condition id="MB9B310R">
      <description>Cypress FM3 MB9B310R Device</description>
      <require Dvendor="Cypress:19"/>
	  <require condition="Compiler ARM"/>
      <accept  Dname="MB9BF312N"/>
      <accept  Dname="MB9BF312R"/>
      <accept  Dname="MB9BF314N"/>
      <accept  Dname="MB9BF314R"/>
      <accept  Dname="MB9BF315N"/>
      <accept  Dname="MB9BF315R"/>
      <accept  Dname="MB9BF316N"/>
      <accept  Dname="MB9BF316R"/>
      <accept  Dname="MB9BF316S"/>
      <accept  Dname="MB9BF316T"/>
      <accept  Dname="MB9BF317S"/>
      <accept  Dname="MB9BF317T"/>
      <accept  Dname="MB9BF318S"/>
      <accept  Dname="MB9BF318T"/>
    </condition>

    <condition id="MB9B400A">
      <description>Cypress FM3 MB9B400A Device</description>
      <require Dvendor="Cypress:19"/>
	  <require condition="Compiler ARM"/>
      <accept  Dname="MB9BF404N"/>
      <accept  Dname="MB9BF404R"/>
      <accept  Dname="MB9BF405N"/>
      <accept  Dname="MB9BF405R"/>
      <accept  Dname="MB9BF406N"/>
      <accept  Dname="MB9BF406R"/>
    </condition>

    <condition id="MB9B410R">
      <description>Cypress FM3 MB9B410R Device</description>
      <require Dvendor="Cypress:19"/>
	  <require condition="Compiler ARM"/>
      <accept  Dname="MB9BF412N"/>
      <accept  Dname="MB9BF412R"/>
      <accept  Dname="MB9BF414N"/>
      <accept  Dname="MB9BF414R"/>
      <accept  Dname="MB9BF415N"/>
      <accept  Dname="MB9BF415R"/>
      <accept  Dname="MB9BF416N"/>
      <accept  Dname="MB9BF416R"/>
      <accept  Dname="MB9BF416S"/>
      <accept  Dname="MB9BF416T"/>
      <accept  Dname="MB9BF417S"/>
      <accept  Dname="MB9BF417T"/>
      <accept  Dname="MB9BF418S"/>
      <accept  Dname="MB9BF418T"/>
    </condition>

    <condition id="MB9BF50x">
      <description>Cypress FM3 MB9BF50x Device</description>
      <require Dvendor="Cypress:19"/>
	  <require condition="Compiler ARM"/>
      <accept  Dname="MB9BF500N"/>
      <accept  Dname="MB9BF500R"/>
    </condition>

    <condition id="MB9B500B">
      <description>Cypress FM3 MB9B500B Device</description>
      <require Dvendor="Cypress:19"/>
	  <require condition="Compiler ARM"/>
      <accept  Dname="MB9BF504N"/>
      <accept  Dname="MB9BF504R"/>
      <accept  Dname="MB9BF505N"/>
      <accept  Dname="MB9BF505R"/>
      <accept  Dname="MB9BF506N"/>
      <accept  Dname="MB9BF506R"/>
    </condition>

    <condition id="MB9B510R">
      <description>Cypress FM3 MB9B510R Device</description>
      <require Dvendor="Cypress:19"/>
	  <require condition="Compiler ARM"/>
      <accept  Dname="MB9BF512N"/>
      <accept  Dname="MB9BF512R"/>
      <accept  Dname="MB9BF514N"/>
      <accept  Dname="MB9BF514R"/>
      <accept  Dname="MB9BF515N"/>
      <accept  Dname="MB9BF515R"/>
      <accept  Dname="MB9BF516N"/>
      <accept  Dname="MB9BF516R"/>
      <accept  Dname="MB9BF516S"/>
      <accept  Dname="MB9BF516T"/>
      <accept  Dname="MB9BF517S"/>
      <accept  Dname="MB9BF517T"/>
      <accept  Dname="MB9BF518S"/>
      <accept  Dname="MB9BF518T"/>
    </condition>

    <condition id="MB9B610T">
      <description>Cypress FM3 MB9B610T Device</description>
      <require Dvendor="Cypress:19"/>
	  <require condition="Compiler ARM"/>
      <accept  Dname="MB9BF616S"/>
      <accept  Dname="MB9BF616T"/>
      <accept  Dname="MB9BF617S"/>
      <accept  Dname="MB9BF617T"/>
      <accept  Dname="MB9BF618S"/>
      <accept  Dname="MB9BF618T"/>
    </condition>

    <condition id="MB9BD10T">
      <description>Cypress FM3 MB9BD10T Device</description>
      <require Dvendor="Cypress:19"/>
	  <require condition="Compiler ARM"/>
      <accept  Dname="MB9BFD16S"/>
      <accept  Dname="MB9BFD16T"/>
      <accept  Dname="MB9BFD17S"/>
      <accept  Dname="MB9BFD17T"/>
      <accept  Dname="MB9BFD18S"/>
      <accept  Dname="MB9BFD18T"/>
    </condition>

