XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.FM3HighPerformance_DFP.pdsc
    <condition id="FM3_HighPerformance CMSIS Device">
      <description>Cypress FM3 CMSIS Device</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Cypress:19"/>
	  <require condition="Compiler ARM"/>
      <accept  condition="MB9B100A"/>
      <accept  condition="MB9B110R"/>
      <accept  condition="MB9B210T"/>
      <accept  condition="MB9B300B"/>
      <accept  condition="MB9B310R"/>
      <accept  condition="MB9B400A"/>
      <accept  condition="MB9B410R"/>
      <accept  condition="MB9BF50x"/>
      <accept  condition="MB9B500B"/>
      <accept  condition="MB9B510R"/>
      <accept  condition="MB9B610T"/>
      <accept  condition="MB9BD10T"/>      
    </condition>
    
    <condition id="MB9B500B CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>Cypress MB9B500B Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="MB9B500B"/>
    </condition>

  </conditions>

  <examples>
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Keil/MCB9F500/Blinky">
      <description>Blinky example</description>
      <board name="MCB9B500" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/Keil/MCB9F500/RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCB9B500" vendor="Keil"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.0.1" condition="FM3_HighPerformance CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Cypress FM3 device series</description>
      <files>

        <!-- additional include path -->
        <file category="include" name="Device/Include/"/>

        <!-- startup files -->
        <file category="sourceAsm" name="Device/Source/MB9B100A/startup_mb9bf10x.s" attr="config"  condition="MB9B100A" version="1.0.2"/>
        <file category="sourceAsm" name="Device/Source/MB9B110R/startup_mb9bf11x.s" attr="config"  condition="MB9B110R" version="1.0.2"/>
        <file category="sourceAsm" name="Device/Source/MB9B210T/startup_mb9bf21x.s" attr="config"  condition="MB9B210T" version="1.0.2"/>
        <file category="sourceAsm" name="Device/Source/MB9B300B/startup_mb9bf30x.s" attr="config"  condition="MB9B300B" version="1.0.2"/>
        <file category="sourceAsm" name="Device/Source/MB9B310R/startup_mb9bf31x.s" attr="config"  condition="MB9B310R" version="1.0.2"/>
        <file category="sourceAsm" name="Device/Source/MB9B400A/startup_mb9bf40x.s" attr="config"  condition="MB9B400A" version="1.0.2"/>
        <file category="sourceAsm" name="Device/Source/MB9B410R/startup_mb9bf41x.s" attr="config"  condition="MB9B410R" version="1.0.2"/>
        <file category="sourceAsm" name="Device/Source/MB9B500B/startup_mb9bf50x.s" attr="config"  condition="MB9B500B" version="1.0.2"/>
        <file category="sourceAsm" name="Device/Source/MB9BF50x/startup_MB9BF50x.s" attr="config"  condition="MB9BF50x" version="1.0.2"/>
        <file category="sourceAsm" name="Device/Source/MB9B510R/startup_mb9bf51x.s" attr="config"  condition="MB9B510R" version="1.0.2"/>
        <file category="sourceAsm" name="Device/Source/MB9B610T/startup_mb9bf61x.s" attr="config"  condition="MB9B610T" version="1.0.2"/>
        <file category="sourceAsm" name="Device/Source/MB9BD10T/startup_mb9bfd1x.s" attr="config"  condition="MB9BD10T" version="1.0.2"/>

        <!-- system file -->
        <file category="sourceC" name="Device/Source/MB9B100A/system_mb9bf10x.c"  attr="config"  condition="MB9B100A" version="1.0.0"/>
        <file category="sourceC" name="Device/Source/MB9B110R/system_mb9bf11x.c"  attr="config"  condition="MB9B110R" version="1.0.0"/>
        <file category="sourceC" name="Device/Source/MB9B210T/system_mb9bf21x.c"  attr="config"  condition="MB9B210T" version="1.0.0"/>
        <file category="sourceC" name="Device/Source/MB9B300B/system_mb9bf30x.c"  attr="config"  condition="MB9B300B" version="1.0.0"/>
        <file category="sourceC" name="Device/Source/MB9B310R/system_mb9bf31x.c"  attr="config"  condition="MB9B310R" version="1.0.0"/>
        <file category="sourceC" name="Device/Source/MB9B400A/system_mb9bf40x.c"  attr="config"  condition="MB9B400A" version="1.0.0"/>
        <file category="sourceC" name="Device/Source/MB9B410R/system_mb9bf41x.c"  attr="config"  condition="MB9B410R" version="1.0.0"/>
        <file category="sourceC" name="Device/Source/MB9B500B/system_mb9bf50x.c"  attr="config"  condition="MB9B500B" version="1.0.0"/>
        <file category="sourceC" name="Device/Source/MB9BF50x/system_MB9BF50x.c"  attr="config"  condition="MB9BF50x" version="1.0.0"/>
        <file category="sourceC" name="Device/Source/MB9B510R/system_mb9bf51x.c"  attr="config"  condition="MB9B510R" version="1.0.0"/>
        <file category="sourceC" name="Device/Source/MB9B610T/system_mb9bf61x.c"  attr="config"  condition="MB9B610T" version="1.0.0"/>
        <file category="sourceC" name="Device/Source/MB9BD10T/system_mb9bfd1x.c"  attr="config"  condition="MB9BD10T" version="1.0.0"/>
      </files>
    </component>

    <!--  MCB9F500 Board support  -->
    <bundle Cbundle="MCB9F500" Cclass="Board Support" Cversion="1.0.0">
      <description>Keil Development Board MCB9F500</description>
      <doc>Documents/mcb9b500.chm</doc>
      <component Cgroup="A/D Converter" Capiversion="1.00" condition="MB9B500B CMSIS Device">
        <description>A/D Converter interface for Keil MCB9F500 Development Board</description>
        <files>
          <file category="sourceC" name="Boards/Keil/MCB9F500/Common/ADC_MCB9F500.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.00" condition="MB9B500B CMSIS Device">
      <description>LED driver for Keil MCB9F500 Development Board</description>
        <files>
        <file category="sourceC" name="Boards/Keil/MCB9F500/Common/LED_MCB9F500.c"/>
        </files>
      </component>
    </bundle>
  </components>

</package>
